app/Controllers/editor/MisNoticias.php

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'borrador'
---
        private function getBorradores(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'borrador');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'validar'
---
        private function getValidar(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'validar');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'descartada'
---
        private function getDescartadas(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'descartada');
            $query = $builder->get();

SELECT `noticias`.*, `rechazos`.`motivo`
FROM `noticias`
JOIN `rechazos` ON `rechazos`.`IDnoticia` = `noticias`.`ID`
WHERE `IDusuario` = '5'
AND `estado` = 'rechazada'
---
        private function getRechazadas(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('noticias.*, rechazos.motivo');
            $builder->join('rechazos', 'rechazos.IDnoticia = noticias.ID');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'rechazada');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'finalizada'
---
        private function getFinalizadas(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'finalizada');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'publicada'
---
        private function getPublicadas(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'publicada');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'despublicada'
---
        private function getDespublicadas(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'despublicada');
            $query = $builder->get();

SELECT *
FROM `noticias`
WHERE `IDusuario` = '5'
AND `estado` = 'correccion'
---
        private function getCorreccion(){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('noticias');
            $builder->select('*');
            $builder->where('IDusuario', $idUsuario);
            $builder->where('estado', 'correccion');
            $query = $builder->get();