app/Controllers/editor/VerHistorial.php

        public function VerHistorial($idNoticia){
            $noticia = $this->noticiasModel->find($idNoticia);
---
SELECT *
FROM `noticias`
WHERE `noticias`.`ID` = '48'

        private function getHistorial($id){
            $idUsuario = $this->session->get('id');
            $db = \config\Database::connect();
            $builder = $db->table('historial');
            $builder->select('historial.*, usuarios.fullname');
            $builder->join('usuarios', 'historial.idUser = usuarios.ID');
            $builder->where('IDnoticia', $id);
            $builder->orderBy('numCambio', 'asc');
            $query = $builder->get();
---
SELECT `historial`.*, `usuarios`.`fullname`
FROM `historial`
JOIN `usuarios` ON `historial`.`idUser` = `usuarios`.`ID`
WHERE `IDnoticia` = '48'
ORDER BY `numCambio` ASC

        private function getRechazos($id){
            return $this->rechazosModel->where('IDnoticia', $id)->findAll();
---
SELECT *
FROM `rechazos`
WHERE `IDnoticia` = '48'