app/Controllers/ListarNoticias.php

    private function getCantNoticiasPublicadas(){
        $db = \config\Database::connect();
        $builder = $db->table('noticias');
        $builder->where('estado', 'publicada');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `noticias`
WHERE `estado` = 'publicada'

    private function getNoticiasPublicadas($limit, $offset){
        $db = \config\Database::connect();
        $builder = $db->table('noticias');
        $builder->select('*');
        $builder->where('estado', 'publicada');
        $builder->orderBy('ID', 'DESC');
        $query = $builder->get($limit, $offset);
---
SELECT *
FROM `noticias`
WHERE `estado` = 'publicada'
ORDER BY `ID` DESC
 LIMIT 6