app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `nickname` = 'fulanito'
 LIMIT 1
---
    public function checkUser($nickname, $passw){
        $resultado = $this->where(['nickname' => $nickname, 'passw' => $passw])->find();